In [3]:
import pandas as pd
import numpy as np

In [6]:
s = pd.Series(np.array([1,2,3]))
print(s)

0    1
1    2
2    3
dtype: int64

In [8]:
s = pd.Series(np.array([2024,6,3]),index=['年','月','日'])
print(s)

年    2024
月       6
日       3
dtype: int64

In [13]:
data = {
    '年':2024
    ,'月':6
    ,'日':3
}
s = pd.Series(data)
print(s)

年    2024
月       6
日       3
dtype: int64

In [14]:
data = {
    '年':0.234
    ,'月':0.666
    ,'日':0.777
}
s = pd.Series(data)
print(s)

年    0.234
月    0.666
日    0.777
dtype: float64

In [18]:
value_to_find=0.777
key = next((k for k, v in data.items() if v == value_to_find), None)
print(key)

日

# 缺值

In [28]:
data = {
    '年':2024
    ,'月':6
    ,'日':3
    ,'時':np.nan
    ,'分':np.nan
}
s = pd.Series(data)
print(s,'\n')

# 找出 NaN 值
s[pd.isna(s)] = 0

print('找出 NaN 值並一次替換\n',s)

年    2024.0
月       6.0
日       3.0
時       NaN
分       NaN
dtype: float64

找出 NaN 值並一次替換
 年    2024.0
月       6.0
日       3.0
時       0.0
分       0.0
dtype: float64

# 合併dataframe

In [29]:
data1=[['A',1],['BB',2],['CCC',3]]
df2=pd.DataFrame(data1,columns=['Name','Age'])
print(df2)

data2=[['AA',11],['BBB',21],['CCCC',31]]
df3=pd.DataFrame(data2,columns=['Name','Age'])

print(df3)
pd.concat([df2,df3])

  Name  Age
0    A    1
1   BB    2
2  CCC    3
   Name  Age
0    AA   11
1   BBB   21
2  CCCC   31

   Name  Age
0     A    1
1    BB    2
2   CCC    3
0    AA   11
1   BBB   21
2  CCCC   31

## index 接著編號

In [33]:
df = pd.concat([df2,df3],ignore_index=True)
df

   Name  Age
0     A    1
1    BB    2
2   CCC    3
3    AA   11
4   BBB   21
5  CCCC   31

In [38]:
for index , row in df.iterrows():
    print('index = ',index)
    print('row = ', row)
    print('============================')

index =  0
row =  Name    A
Age     1
Name: 0, dtype: object
============================
index =  1
row =  Name    BB
Age      2
Name: 1, dtype: object
============================
index =  2
row =  Name    CCC
Age       3
Name: 2, dtype: object
============================
index =  3
row =  Name    AA
Age     11
Name: 3, dtype: object
============================
index =  4
row =  Name    BBB
Age      21
Name: 4, dtype: object
============================
index =  5
row =  Name    CCCC
Age       31
Name: 5, dtype: object
============================

In [39]:
df = pd.DataFrame({
    'key1' : ['a','a','b','b','a'],
    'key2' : ['one','two','one','two','one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)
})
print(df)

  key1 key2     data1     data2
0    a  one  0.020882 -1.071114
1    a  two  1.838720 -0.168789
2    b  one  0.111243 -0.369645
3    b  two  0.282598  0.906936
4    a  one -0.332330  0.023934

In [48]:
grouped = df.groupby(df['key1'])
for i, group in grouped:
    print(f'============== 分組 {i}    ===================')
    print(group)
    print('\n')

============== 分組 a    ===================
  key1 key2     data1     data2
0    a  one  0.020882 -1.071114
1    a  two  1.838720 -0.168789
4    a  one -0.332330  0.023934


============== 分組 b    ===================
  key1 key2     data1     data2
2    b  one  0.111243 -0.369645
3    b  two  0.282598  0.906936